tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.org/cabin/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/cabin";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue           table
        (
            (0   273)
            (60  273)
            (61  308)
            (100 308)
        );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            zeroGradient;
    }
    cabin_to_windshield
    {
        type            humidityTemperatureCoupledMixed;
        kappa           fluidThermo;
        kappaName       none;

        // Mode of operation: inert, condensation, vaporization,
        // condensationAndEvaporation
        mode            condensationAndEvaporation;
        specieName      H2O;
        carrierMolWeight  28.9 ;//Air from thermophysicalProperties
        L               0.1;
        Tvap            273;    //Minimum temperature for evaporation

        liquid
        {
            H2O
            {
                defaultCoeffs       yes;
            }
        }

        value           $internalField;
    }
}


// ************************************************************************* //
